src/cf/Catalogs/fmItemGroups.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>fmItemGroups</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ItemType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fmBudgetOperationTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Items</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Item</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.fmIncomesAndExpensesItems</v8:Type>
								<v8:Type>cfg:CatalogRef.fmCashflowItems</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/fmBudgetOperationTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>fmBudgetOperationTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>IncomesAndExpenses</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Cashflows</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>InternalSettlements</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/fmIncomesAndExpensesItems.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>fmIncomesAndExpensesItems</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ItemType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fmBudgetFlowOperationTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AnalyticsType1</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.fmAnalyticsTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AnalyticsType2</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.fmAnalyticsTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AnalyticsType3</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.fmAnalyticsTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInfo</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>EntriesTemplates</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>AccountDr</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.fmBudgeting</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AccountCr</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.fmBudgeting</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AmountCalculationRatio</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>OperationType</Name>
							<Type>
								<v8:Type>cfg:EnumRef.fmBudgetOperationTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BalanceUnit</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExtDimensionDr1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExtDimensionDr2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExtDimensionDr3</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExtDimensionCr1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExtDimensionCr2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExtDimensionCr3</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DepartmentDr</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DepartmentCr</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/fmItemGroups/Ext/ObjectModule.bsl
#If Server OR ThickClientOrdinaryApplication OR ExternalConnection Then

Procedure Filling(FillingData, FillingText, StandardProcessing)
	ThisObject.ItemType = Enums.fmBudgetOperationTypes.IncomesAndExpenses;
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckingAttributes)
	
	Query = New Query;
	Query.Text = "SELECT
	               |	fmIncomesAndExpensesItems.{fm}AnalyticsType1 AS AnalyticsType1,
	               |	fmIncomesAndExpensesItems.{fm}AnalyticsType2 AS AnalyticsType2,
	               |	fmIncomesAndExpensesItems.{fm}AnalyticsType3 AS AnalyticsType3
	               |FROM
	               |	Catalog.fmIncomesAndExpensesItems AS fmIncomesAndExpensesItems
	               |WHERE
	               |	fmIncomesAndExpensesItems.Ref IN (&ItemsList)
	               |GROUP BY
	               |	fmIncomesAndExpensesItems.{fm}AnalyticsType1,
	               |	fmIncomesAndExpensesItems.{fm}AnalyticsType2,
	               |	fmIncomesAndExpensesItems.{fm}AnalyticsType3";
	If ItemType = Enums.fmBudgetOperationTypes.Cashflows Then
		Query.Text = StrReplace(Query.Text,"{fm}","fm");
		Query.Text = StrReplace(Query.Text,"fmIncomesAndExpensesItems","fmCashflowItems");
	ElsIf ItemType = Enums.fmBudgetOperationTypes.IncomesAndExpenses Then
		Query.Text = StrReplace(Query.Text,"{fm}","");
	EndIf;
	Query.SetParameter("ItemsList", Items.UnloadColumn("Item"));
	Result = Query.Execute().Unload();
	If Result.Count()>1 Then
		CommonClientServer.MessageToUser(NStr("en='Group items have different dimensions';ru='В статьях группы есть различные аналитики'"),,,,Cancel);
	EndIf;
	
EndProcedure

#EndIf
